In [1]:
import pandas as pd

In [2]:
plane_df =  pd.read_csv('data/Plane_crash.csv')
plane_df.head()

,Date,Time,Location,Latitude,Longitude,Operator,Flight #,Route,Type,Registration,cn/In,Aboard,Fatalities,Ground,Summary
0,7/12/1912,6:30,"AtlantiCity, New Jersey",39.3606,-74.4319,Military - U.S. Navy,NaN,Test flight,Dirigible,NaN,NaN,5.0,5.0,0.0,First U.S. dirigible Akron exploded just offsh...
1,8/6/1913,NaN,"Victoria, British Columbia, Canada",48.4275,-123.3673,Private,-,NaN,Curtiss seaplane,NaN,NaN,1.0,1.0,0.0,The first fatal airplane accident in Canada oc...
2,9/9/1913,18:30,Over the North Sea,40.9406,-72.4031,Military - German Navy,NaN,NaN,Zeppelin L-1 (airship),NaN,NaN,20.0,14.0,0.0,The airship flew into a thunderstorm and encou...
3,10/17/1913,10:30,"Johannisthal, Germany",52.4363,13.5501,Military - German Navy,NaN,NaN,Zeppelin L-2 (airship),NaN,NaN,30.0,30.0,0.0,Hydrogen gas which was being vented was sucked...
4,3/5/1915,1:00,"Montieri, Italy",43.1167,11.0167,Military - German Navy,NaN,NaN,Zeppelin L-8 (airship),NaN,NaN,41.0,21.0,0.0,Crashed into trees while attempting to land af...

In [3]:
del plane_df['Flight #']
del plane_df['Route']
del plane_df['Type']
del plane_df['Registration']
del plane_df['cn/In']
del plane_df['Ground']
del plane_df['Summary']

In [4]:
plane_df.head()

,Date,Time,Location,Latitude,Longitude,Operator,Aboard,Fatalities
0,7/12/1912,6:30,"AtlantiCity, New Jersey",39.3606,-74.4319,Military - U.S. Navy,5.0,5.0
1,8/6/1913,NaN,"Victoria, British Columbia, Canada",48.4275,-123.3673,Private,1.0,1.0
2,9/9/1913,18:30,Over the North Sea,40.9406,-72.4031,Military - German Navy,20.0,14.0
3,10/17/1913,10:30,"Johannisthal, Germany",52.4363,13.5501,Military - German Navy,30.0,30.0
4,3/5/1915,1:00,"Montieri, Italy",43.1167,11.0167,Military - German Navy,41.0,21.0

In [7]:
from sqlalchemy import create_engine
import psycopg2
from sqlalchemy.types import Integer, VARCHAR, Text, String, DateTime, Float
engine = create_engine('postgres://postgres:postgres@localhost:5432/plane_crash', paramstyle='format')

plane_df.to_sql(
    name = "plane",
    con = engine,
    if_exists='replace',
    index=False,
    dtype={"Date": VARCHAR,
            "Time": VARCHAR,
            "Location": VARCHAR,
            "Latitude": VARCHAR,
            "Longitude": VARCHAR
    }
)

In [8]:
pd.read_sql("select * from plane", engine)

,Date,Time,Location,Latitude,Longitude,Operator,Aboard,Fatalities
0,7/12/1912,6:30,"AtlantiCity, New Jersey",39.3606,-74.4319,Military - U.S. Navy,5.0,5.0
1,8/6/1913,None,"Victoria, British Columbia, Canada",48.4275,-123.3673,Private,1.0,1.0
2,9/9/1913,18:30,Over the North Sea,40.9406,-72.4031,Military - German Navy,20.0,14.0
3,10/17/1913,10:30,"Johannisthal, Germany",52.4363,13.5501,Military - German Navy,30.0,30.0
4,3/5/1915,1:00,"Montieri, Italy",43.1167,11.0167,Military - German Navy,41.0,21.0
...,...,...,...,...,...,...,...,...
3770,5/3/2009,12:00,"Port Hope Simpson, Newfoundland, Canada",52.5333,-56.3,Military - Venezuelan Army,18.0,18.0
3771,5/20/2009,6:30,"Madiun, Indonesia",-7.5946,111.5449,Military - Indonesian Air Force,112.0,98.0
3772,5/26/2009,None,"Isiro, DemocratiRepubliCongo",2.7574,27.6262,Service Air,4.0,4.0
3773,6/1/2009,0:15,"Port Hope Simpson, Newfoundland, Canada",52.5333,-56.3,Air France,228.0,228.0
3774,6/7/2009,8:30,"Port Hope Simpson, Newfoundland, Canada",52.5333,-56.3,Strait Air,1.0,1.0